In [1]:
import pandas as pd

In [2]:
s1=pd.Series(['a','b','c'])
s2=pd.Series(['d','e','f','z'])

In [3]:
s1

0    a
1    b
2    c
dtype: object

In [4]:
s2

0    d
1    e
2    f
3    z
dtype: object

In [5]:
pd.concat([s1,s2])

0    a
1    b
2    c
0    d
1    e
2    f
3    z
dtype: object

In [6]:
pd.concat([s1,s2],ignore_index=True)

0    a
1    b
2    c
3    d
4    e
5    f
6    z
dtype: object

In [7]:
pd.concat([s1,s2],axis=1)

     0  1
0    a  d
1    b  e
2    c  f
3  NaN  z

In [9]:
pd.concat([s1,s2],axis=1,keys=['col1','col2'])

  col1 col2
0    a    d
1    b    e
2    c    f
3  NaN    z

In [10]:
pd.concat([s1,s2],axis=1,keys=['col1','col2'],join='inner')

  col1 col2
0    a    d
1    b    e
2    c    f

In [11]:
animal=pd.Series(data=['cat','dog','frog'],
         index=['c','d','f'])

In [12]:
animal

c     cat
d     dog
f    frog
dtype: object

In [13]:
fruit=pd.Series(data=['apple','orange','banana'],
         index=['a','o','b'])

In [14]:
fruit

a     apple
o    orange
b    banana
dtype: object

In [15]:
pd.concat([animal,fruit])

c       cat
d       dog
f      frog
a     apple
o    orange
b    banana
dtype: object

In [16]:
pd.concat([animal,fruit],ignore_index=True)

0       cat
1       dog
2      frog
3     apple
4    orange
5    banana
dtype: object

In [19]:
d1=pd.DataFrame(
    [['potato',900],['garlic',1350],['onion',875]],
    columns=['crop','qty']
)
d2=pd.DataFrame(
    {'crpo':['potato','garlic','onion'],'qty':[900,1350,875]}
)

In [18]:
d1

     crop   qty
0  potato   900
1  garlic  1350
2   onion   875

In [20]:
d2

     crpo   qty
0  potato   900
1  garlic  1350
2   onion   875

In [2]:
d3=pd.DataFrame(
    {'first':['alex','rayna','alex','juan'],'last':['aaaa','bbbb','cccc','dddd'],
    'score':[97,88,86,81],'extra':[False,True,True,True]}
)

In [25]:
d3

   first  last  score  extra
0   alex  aaaa     97  False
1  rayna  bbbb     88   True
2   alex  cccc     86   True
3   juan  dddd     81   True

In [3]:
d4=pd.DataFrame(
    {'first':['alex','rayna','alex','juan','ros'],'last':['aaaa','bbbb','cccc','dddd','eeee'],
    'score':[100,89,77,90,98]}
)

In [29]:
d4

   first  last  score
0   alex  aaaa    100
1  rayna  bbbb     89
2   alex  cccc     77
3   juan  dddd     90
4    ros  eeee     98

In [32]:
d3.merge(d4,on=["first","last"])

   first  last  score_x  extra  score_y
0   alex  aaaa       97  False      100
1  rayna  bbbb       88   True       89
2   alex  cccc       86   True       77
3   juan  dddd       81   True       90

In [33]:
d4.merge(d3)

Empty DataFrame
Columns: [first, last, score, extra]
Index: []

In [36]:
d3.merge(d4,on=["first","last"],how="outer")

   first  last  score_x  extra  score_y
0   alex  aaaa     97.0  False      100
1  rayna  bbbb     88.0   True       89
2   alex  cccc     86.0   True       77
3   juan  dddd     81.0   True       90
4    ros  eeee      NaN    NaN       98

In [37]:
d3.merge(d4,on=["first","last"],how="right")

   first  last  score_x  extra  score_y
0   alex  aaaa     97.0  False      100
1  rayna  bbbb     88.0   True       89
2   alex  cccc     86.0   True       77
3   juan  dddd     81.0   True       90
4    ros  eeee      NaN    NaN       98

In [38]:
d3.merge(d4,on=["first","last"],how="left")

   first  last  score_x  extra  score_y
0   alex  aaaa       97  False      100
1  rayna  bbbb       88   True       89
2   alex  cccc       86   True       77
3   juan  dddd       81   True       90

In [40]:
d3.merge(d4,on=["first","last"],how="outer",suffixes=("_mid","_final"))

   first  last  score_mid  extra  score_final
0   alex  aaaa       97.0  False          100
1  rayna  bbbb       88.0   True           89
2   alex  cccc       86.0   True           77
3   juan  dddd       81.0   True           90
4    ros  eeee        NaN    NaN           98

In [44]:
dfmerg=d3.merge(d4,on=["first","last"],how="outer",suffixes=("_mid","_final"))

In [45]:
dfmerg["avrage"]=(dfmerg["score_final"]+dfmerg["score_mid"])/2

In [47]:
dfmerg

   first  last  score_mid  extra  score_final  avrage
0   alex  aaaa       97.0  False          100    98.5
1  rayna  bbbb       88.0   True           89    88.5
2   alex  cccc       86.0   True           77    81.5
3   juan  dddd       81.0   True           90    85.5
4    ros  eeee        NaN    NaN           98     NaN

In [48]:
dfmerg.loc[dfmerg["extra"]==True ,'avrage'] +=5

In [49]:
dfmerg

   first  last  score_mid  extra  score_final  avrage
0   alex  aaaa       97.0  False          100    98.5
1  rayna  bbbb       88.0   True           89    93.5
2   alex  cccc       86.0   True           77    86.5
3   juan  dddd       81.0   True           90    90.5
4    ros  eeee        NaN    NaN           98     NaN

In [51]:
dfmerg['avrage'] +=1

In [52]:
dfmerg

   first  last  score_mid  extra  score_final  avrage
0   alex  aaaa       97.0  False          100    99.5
1  rayna  bbbb       88.0   True           89    94.5
2   alex  cccc       86.0   True           77    87.5
3   juan  dddd       81.0   True           90    91.5
4    ros  eeee        NaN    NaN           98     NaN

In [59]:
dfmerg[dfmerg["extra"]==True]['avrage']

1    94.5
2    87.5
3    91.5
Name: avrage, dtype: float64

In [60]:
dfmerg[dfmerg["extra"]==True]

   first  last  score_mid extra  score_final  avrage
1  rayna  bbbb       88.0  True           89    94.5
2   alex  cccc       86.0  True           77    87.5
3   juan  dddd       81.0  True           90    91.5

In [61]:
dfmerg[dfmerg["extra"]==True]['avrage'] +=5

C:\Users\Microsoft\AppData\Local\Temp\ipykernel_348\3297979770.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfmerg[dfmerg["extra"]==True]['avrage'] +=5

In [62]:
dfmerg

   first  last  score_mid  extra  score_final  avrage
0   alex  aaaa       97.0  False          100    99.5
1  rayna  bbbb       88.0   True           89    94.5
2   alex  cccc       86.0   True           77    87.5
3   juan  dddd       81.0   True           90    91.5
4    ros  eeee        NaN    NaN           98     NaN

In [6]:
d5=pd.DataFrame(
    {'first':['alex','rayna','alex','juan','ros'],'last':['aaaa','bbbb','cccc','dddd','eeee'],
    'score':[100,89,77,90,98]}
)   
d6=pd.DataFrame(
    {'first':['alex','rayna','alex','juan'],'last':['aaaa','bbbb','cccc','dddd'],
    'score':[100,88,86,90],'extra':[False,True,True,True]}
)  
dmerge1=d5.merge(d6,on=["first","last"],how="outer",suffixes=("_mid","_final"))
dmerge1

   first  last  score_mid  score_final  extra
0   alex  aaaa        100        100.0  False
1  rayna  bbbb         89         88.0   True
2   alex  cccc         77         86.0   True
3   juan  dddd         90         90.0   True
4    ros  eeee         98          NaN    NaN

In [8]:
if dmerge1.score_mid==dmerge1.score_final:
    denerge1.result=True
denerge1.result=False
end

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().